# 3 - В файле, содержащем фамилии студентов и их оценки, изменить на прописные буквы фамилии тех студентов, которые имеют средний балл более «4».
# Нужно перезаписать файл.
# Пример:
# Ангела Меркель 5
# Энакин Скайуокер 5
# Фредди Меркури 3
# Александр Пушкин 4

# Программа выдаст:
# АНГЕЛА МЕРКЕЛЬ 5
# ЭНАКИН СКАЙУОКЕР 5
# Фредди Меркури 3
# Александр Пушкин 4

# with open ('file.txt','w') as data:
#     data.write('Ангела Меркель 5\n')
#     data.write('Энакин Скайуокер 5\n')
#     data.write('Фредди Меркури 3\n')
#     data.write('Александр Пушкин 4\n')


# ЧТЕНИЕ
# path = 'file.txt'
# data = open (path, 'r')
# for line in data:
#     print(line)
# data.close()