# 3- Создайте программу для игры в ""Крестики-нолики"". 
# Для определения победы вам может пригодиться функция filter. 
# Проверяйте победу после каждого хода, фильтруя столбцы, строки и диагонали по знаку хода

from function_task_3 import start_game, turn, player_1_turn, player_2_turn, create_field

start_game()
create_field()
turn()
player_1_turn()
create_field()


#Проверки не сделала, правда, ни на что)Но для меня даже вот этот скелетик, написанный с помощью интернета, 
#огромный успех=)
# После победы игрока только не могу понять гле стопорнуть цикл, не получается почему то. 